; domain
(define (domain office)
  (:requirements   :strips  :typing  :negative-preconditions :disjunctive-preconditions :fluents :equality :conditional-effects)
  (:types
   room buzzer buzzer1 person light fan heater message  - object
   )
   
    (:predicates
          
          (comfortable-temperature)
          (brightness-sufficient)
          (bodytempcheck-performed)
          (person-detected)
          (off ?l - light)
          (off1 ?f - fan)
          (off2 ?h - heater)
          (off3 ?b - buzzer)
          (off4 ?b1 - buzzer1)
          (at-light ?l - light  ?r - room)
          (at-fan ?f - fan ?r - room)
          (at-heater ?h - heater ?r - room)
          (at-buzzer ?b - buzzer ?p - person)
          (at-buzzer1 ?b1 - buzzer1 ?p - person)
          (send ?m - message)     
    )

   (:functions
    
	  (temp ?r - room)
	  (lightintensity ?r - room)
	  (humidity ?r - room)
	  (bodytemp ?p - person)
	  (motion ?p - person)
	  (temp_limit)
	  (humidity_limit)
	  (lightintensity_limit)
	  (bodytemp_limit)
	  (motion_value)
   )
	  
  
  ; automatic brightness control in the office


   
   (:action switchoff_light
        :parameters (?l - light ?r - room ?m - message)
        :precondition (and (off ?l) (>(lightintensity ?r) (lightintensity_limit)))
        :effect (and (not(off ?l)) (send ?m) (brightness-sufficient))
    )

    (:action switchon_light
        :parameters (?l - light ?r - room ?m - message)
        :precondition (or (not(off ?l)) (<(lightintensity ?r) (lightintensity_limit)))
        :effect (and (off ?l) (send ?m) (brightness-sufficient))
    )
   
   
   
   ; automatic ventilator control in the office

     
       
   (:action switchoff_fan
        :parameters (?f - fan ?r - room ?m - message)
        :precondition (and (off1 ?f) (<(temp ?r) (temp_limit)) (<(humidity ?r) (humidity_limit)))
        :effect (and(not(off1 ?f)) (send ?m) (comfortable-temperature))
   )
   
   (:action switchon_fan
        :parameters (?f - fan ?r - room ?m - message)
        :precondition (or (not(off1 ?f)) (>(temp ?r) (temp_limit)) (>(humidity ?r) (humidity_limit)))
        :effect (and (off1 ?f) (send ?m) (comfortable-temperature))
   )
   


   ; automatic heater valve control in the office



    (:action switchoff_heater
        :parameters (?h - heater ?r - room ?m - message)
        :precondition (and (off2 ?h) (>(temp ?r) (temp_limit)) (>(humidity ?r) (humidity_limit)))
        :effect (and(not(off2 ?h)) (send ?m) (comfortable-temperature))
     )
   
    (:action switchon_heater
        :parameters (?h - heater ?r - room ?m - message)
        :precondition (or (not(off2 ?h)) (<(temp ?r) (temp_limit)) (<(humidity ?r) (humidity_limit)))
        :effect (and (off2 ?h) (send ?m) (comfortable-temperature))
     )
   
   
    ; automatic bodytemp check in front of the office



    (:action switchoff_buzzer
        :parameters (?b - buzzer ?p - person ?m - message)
        :precondition (and (off3 ?b) (<(bodytemp ?p) (bodytemp_limit))) 
        :effect (and(not(off3 ?b)) (send ?m) (bodytempcheck-performed))
     )
   
     (:action switchon_buzzer
        :parameters (?b - buzzer ?p - person ?m - message)
        :precondition (or (not(off3 ?b)) (>(bodytemp ?p) (bodytemp_limit)))
        :effect (and (off3 ?b) (send ?m) (bodytempcheck-performed))
     )    

     ; ir sesnsor to detect person movement

    (:action switchoff_buzzer1
        :parameters (?b1 - buzzer1 ?p - person ?m - message)
        :precondition (and (off4 ?b1) (<(motion ?p) (motion_value))) 
        :effect (and(not(off4 ?b1)) (send ?m) (person-detected))
     )
   
     (:action switchon_buzzer1
        :parameters (?b1 - buzzer1 ?p - person ?m - message)
        :precondition (or (not(off4 ?b1)) (>=(motion ?p) (motion_value)))
        :effect (and (off4 ?b1) (send ?m) (person-detected))
     )    
)

; problem
(define (problem smartoffice)
(:domain office)
(:objects
   r - room
   f - fan
   l - light
   h - heater
   b - buzzer
   b1 - buzzer1
   p - person
   m - message)

(:init
   
    
    (off l)
    (at-light l r)
    
    (off1 f)
    (at-fan f r)

    (off2 h)
    (at-heater h r)

    (off3 b)
    (at-buzzer b p)

    (off4 b1 )
    (at-buzzer1 b1 p)
    
    
    ;temperature
    (= (temp_limit) 22)
    (= (temp r) 21.0)
    
    ;humidity
    
    (= (humidity_limit) 60)
    (= (humidity r) 55.0 )
    

    ;light intensity
    (= (lightintensity_limit) 8000)
    (= (lightintensity r) 7000.0)
   
    ; body temperature
    (= (bodytemp_limit) 22)
    (= (bodytemp p) 27.0)

    ;motion
    (= (motion_value) 1)
    (= (motion p) 2)

)
(:goal
    (and
          (comfortable-temperature)
          (brightness-sufficient)
          (bodytempcheck-performed)
          (person-detected)
    ))
)

; plan
1. (switchon_buzzer1 b1 p m)
   added: (send m) (person-detected)
   goals met: 1 of 4
2. (switchon_buzzer b p m)
   added: (bodytempcheck-performed)
   goals met: 2 of 4
3. (switchon_heater h r m)
   added: (comfortable-temperature)
   goals met: 3 of 4
4. (switchon_light l r m)
   added: (brightness-sufficient)
   goals met: 4 of 4
